Repository: fatimahh0/build4allFront
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: App
ar: التطبيق

# loginTitle
source: Log in
ar: تسجيل الدخول

# loginSubtitle
source: Welcome back! Please sign in to continue.
ar: مرحبًا بعودتك! سجّل دخولك للمتابعة.

# emailLabel
source: Email
ar: البريد الإلكتروني

# passwordLabel
source: Password
ar: كلمة المرور

# phoneLabel
source: Phone number
ar: رقم الهاتف

# loginButton
source: Log in
ar: تسجيل الدخول

# fieldRequired
source: This field is required.
ar: هذا الحقل مطلوب.

# invalidEmail
source: Please enter a valid email address.
ar: يرجى إدخال بريد إلكتروني صحيح.

# invalidPhone
source: Please enter a valid phone number.
ar: يرجى إدخال رقم هاتف صحيح.

# passwordTooShort
source: Password must be at least 6 characters long.
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل.

# authErrorGeneric
source: Something went wrong. Please try again.
ar: حدث خطأ ما. حاول مرة أخرى.

# noAccountText
source: Don't have an account?
ar: ليس لديك حساب؟

# signUpText
source: Sign up
ar: إنشاء حساب

# loginWithEmail
source: Email
ar: البريد الإلكتروني

# loginWithPhone
source: Phone
ar: الهاتف

# loginMissingIdentifier
source: Please enter your email or phone number.
ar: يرجى إدخال بريدك الإلكتروني أو رقم هاتفك.

source: Forgot password?
ar: هل نسيت كلمة المرور؟

# registerTitle
source: Create your account
ar: إنشاء حسابك

# registerSubtitle
source: Choose how you want to sign up.
ar: اختر طريقة التسجيل التي تفضلها.

# registerStep1Of3
source: Step 1 of 3
ar: الخطوة 1 من 3

# registerWithEmail
source: Sign up with email
ar: التسجيل بالبريد الإلكتروني

# registerWithPhone
source: Sign up with phone
ar: التسجيل برقم الهاتف

# registerContinueButton
source: Continue
ar: متابعة

# confirmPasswordLabel
source: Confirm password
ar: تأكيد كلمة المرور

source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.

# alreadyHaveAccountText
source: Already have an account?
ar: لديك حساب بالفعل؟

# verifyCodeTitle
source: Enter verification code
ar: إدخال رمز التحقق

# verifyCodeSubtitleEmail
source: We sent a code to your email.
ar: أرسلنا رمزًا إلى بريدك الإلكتروني.

# verifyCodeSubtitlePhone
source: We sent a code to your phone.
ar: أرسلنا رمزًا إلى هاتفك.

# verificationCodeLabel
source: Verification code
ar: رمز التحقق

# invalidVerificationCode
source: Please enter a valid verification code.
ar: يرجى إدخال رمز تحقق صحيح.

# verifyButtonLabel
source: Verify
ar: تحقق

# completeProfileTitle
source: Complete your profile
ar: إكمال ملفك الشخصي

# completeProfileSubtitle
source: Pick a username and your real name.
ar: اختر اسم مستخدم وأدخل اسمك الحقيقي.

# usernameLabel
source: Username
ar: اسم المستخدم

# firstNameLabel
source: First name
ar: الاسم الأول

# lastNameLabel
source: Last name
ar: اسم العائلة

# usernameTooShort
source: Username must be at least 3 characters.
ar: يجب أن يكون اسم المستخدم 3 أحرف على الأقل.

# publicProfileLabel
source: Public profile
ar: ملف شخصي عام

# publicProfileDescription
source: If enabled, your profile and activities can be found by other users.
ar: عند تفعيله، يمكن للآخرين العثور على ملفك ونشاطاتك.

# saveProfileButton
source: Save profile
ar: حفظ الملف الشخصي

# profileCompletedSuccessMessage
source: Profile completed successfully. You can now log in.
ar: تم إكمال الملف الشخصي بنجاح. يمكنك الآن تسجيل الدخول.

# profileCompletedErrorMessage
source: Failed to complete profile. Please try again.
ar: فشل إكمال الملف الشخصي. يرجى المحاولة مرة أخرى.

# featureComingSoon
source: This feature is coming soon.
ar: هذه الميزة قادمة قريبًا.

# changePhotoHint
source: Tap to add a profile photo
ar: اضغط لإضافة صورة للملف الشخصي

# previousStepButton
source: Previous Step
ar: الخطوة السابقة

# completeProfileNamesTitle
source: Complete Your Profile - Names
ar: إكمال الملف الشخصي - الأسماء

# completeProfileNamesSubtitle
source: Please provide your first and last name.
ar: يرجى إدخال الاسم الأول واسم العائلة.

# firstNameHint
source: Enter your first name
ar: أدخل الاسم الأول

# lastNameHint
source: Enter your last name
ar: أدخل اسم العائلة

# continueButton
source: Continue
ar: متابعة

# completeProfileUsernameTitle
source: Complete Your Profile - Username
ar: إكمال الملف الشخصي - اسم المستخدم

# completeProfileUsernameSubtitle
source: Choose a unique username for your account.
ar: اختر اسم مستخدم فريدًا لحسابك.

# completeProfilePhotoTitle
source: Complete Your Profile - Photo
ar: إكمال الملف الشخصي - الصورة

# completeProfilePhotoSubtitle
source: Add a profile picture to personalize your account.
ar: أضف صورة للملف الشخصي لتخصيص حسابك.

# nextStepButton
source: Next Step
ar: الخطوة التالية

# home_welcome
source: Welcome 👋
ar: أهلًا 👋

# home_search_hint
source: Search products, brands...
ar: ابحث عن المنتجات، العلامات التجارية...

# home_banner_title
source: Special Offers
ar: عروض خاصة

# home_banner_subtitle
source: Save up to 50% on selected items.
ar: وفر حتى 50% على منتجات مختارة.

# home_banner_button
source: Start shopping
ar: ابدأ التسوق

# home_items_default_title
source: Items
ar: المنتجات

# home_recommended_title
source: Recommended for you
ar: موصى به لك

# home_popular_title
source: Popular now
ar: الأكثر شيوعًا الآن

# home_bookings_title
source: Upcoming bookings
ar: الحجوزات القادمة

# home_reviews_title
source: Latest reviews
ar: أحدث المراجعات

# home_flash_sale_title
source: Flash Sale
ar: تخفيضات خاطفة

# home_new_arrivals_title
source: New Arrivals
ar: وصل حديثًا

# home_best_sellers_title
source: Best Sellers
ar: الأكثر مبيعًا

# home_top_rated_title
source: Top Rated
ar: الأعلى تقييمًا

# home_why_shop_title
source: Why Shop With Us
ar: لماذا تتسوق معنا

# home_why_shop_free_shipping_title
source: Free Shipping
ar: شحن مجاني

# home_why_shop_free_shipping_subtitle
source: On all orders over $50
ar: على الطلبات فوق 50$

# home_why_shop_easy_returns_title
source: Easy Returns
ar: إرجاع سهل

# home_why_shop_easy_returns_subtitle
source: 30-day return policy
ar: سياسة إرجاع لمدة 30 يومًا

# home_why_shop_secure_payment_title
source: Secure Payment
ar: دفع آمن

# home_why_shop_secure_payment_subtitle
source: 100% protected transactions
ar: معاملات محمية 100%

# home_why_shop_support_title
source: 24/7 Support
ar: دعم 24/7

# home_why_shop_support_subtitle
source: Always here to help you
ar: نحن هنا دائمًا لمساعدتك

# connection_offline
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# connection_server_down
source: Server is not responding
ar: الخادم لا يستجيب

# profile_login_required
source: Please log in to view your profile.
ar: يرجى تسجيل الدخول لعرض ملفك الشخصي.

source: Connection issue
ar: مشكلة في الاتصال

# explore_title
source: Explore
ar: استكشاف

# explore_search_hint
source: Search places...
ar: ابحث ..

# explore_items_title
source: All activities
ar: كل الأنشطة

# explore_empty_message
source: No results found. Try another keyword.
ar: لا توجد نتائج. جرّب كلمة أخرى.

# explore_category_all
source: All
ar: الكل

# explore_results_label
source: {count, plural, =0{No results} =1{1 result} other{{count} results}}
ar: {count, plural, =0{لا توجد نتائج} =1{نتيجة واحدة} other{{count} نتائج}}

# explore_sort_relevance
source: Relevance
ar: الأكثر صلة

# explore_sort_price_low_high
source: Price: Low to High
ar: السعر: من الأقل إلى الأعلى

# explore_sort_price_high_low
source: Price: High to Low
ar: السعر: من الأعلى إلى الأقل

# explore_sort_date_soonest
source: Soonest date
ar: الأقرب موعدًا

# profileMotto
source: Live your hobby!
ar: عِش هوايتك!

# profile_load_error
source: Couldn't load your profile. Please try again.
ar: تعذر تحميل ملفك الشخصي. يرجى المحاولة مرة أخرى.

source: Retry
ar: إعادة المحاولة

source: Manage account
ar: إدارة الحساب

# profileMakePrivate
source: Make profile private
ar: جعل الملف الشخصي خاصًا

# profileMakePublic
source: Make profile public
ar: جعل الملف الشخصي عامًا

# setInactive
source: Set account inactive
ar: تعطيل الحساب

# profileLogoutConfirm
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# deactivate_title
source: Deactivate account
ar: تعطيل الحساب

# deactivate_warning
source: Enter your password to confirm deactivation.
ar: أدخل كلمة المرور لتأكيد التعطيل.

# current_password_label
source: Current password
ar: كلمة المرور الحالية

# language_note
source: Changing language will restart some screens.
ar: تغيير اللغة قد يعيد تشغيل بعض الشاشات.

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Log out
ar: تسجيل الخروج

# adminDashboardTitle
source: Admin dashboard
ar: لوحة تحكم الأدمن

# adminDashboardSubtitle
source: Manage your app content and settings.
ar: إدارة محتوى التطبيق والإعدادات.

# adminProductsTitle
source: Products
ar: المنتجات

# adminProductsEmpty
source: No products yet. Tap + to add your first product.
ar: لا توجد منتجات بعد. اضغط + لإضافة أول منتج.

# adminProductsNewArrivals
source: New arrivals
ar: وصل حديثًا

# adminProductsBestSellers
source: Best sellers
ar: الأكثر مبيعًا

# adminProductsDiscounted
source: Discounted products
ar: منتجات مخفضة

# adminProductsSearchPlaceholder
source: Search products...
ar: ابحث عن منتجات...

# accountInactiveTitle
source: Your account is inactive
ar: حسابك غير نشط

# accountInactiveBody
source: Your account is currently inactive. Do you want to reactivate it to continue?
ar: حسابك غير نشط حاليًا. هل تريد إعادة تفعيله للمتابعة؟

# reactivateButton
source: Reactivate
ar: إعادة التفعيل

# accountReactivated
source: Your account has been reactivated successfully
ar: تمت إعادة تفعيل حسابك بنجاح

# chooseSignInRole
source: Choose how to sign in
ar: اختر طريقة تسجيل الدخول

# enterAsOwner
source: Enter as Owner (Admin)
ar: الدخول كمالك (مدير)

source: Enter as User
ar: الدخول كمستخدم

# roleLabel
source: Role
ar: الدور

# userLabel
source: User
ar: مستخدم

# loginInactiveTitle
source: Reactivate your account?
ar: إعادة تفعيل حسابك؟

# loginInactiveMessage
source: Your account "{name}" is currently inactive. Do you want to reactivate it and continue?
ar: حسابك "{name}" غير نشط حاليًا. هل تريد إعادة تفعيله والمتابعة؟

# loginInactiveReactivate
source: Reactivate
ar: إعادة التفعيل

# loginInactiveCancel
source: Not now
ar: ليس الآن

# loginInactiveRequired
source: You must reactivate your account to sign in as user.
ar: يجب إعادة تفعيل حسابك لتسجيل الدخول كمستخدم.

# loginChooseRoleTitle
source: Choose how to sign in
ar: اختر طريقة تسجيل الدخول

# loginEnterAsOwner
source: Enter as Owner (Admin)
ar: الدخول كمالك (مدير)

# loginEnterAsUser
source: Enter as User
ar: الدخول كمستخدم

# loginRoleLabel
source: Role:
ar: الدور:

# loginUserFallbackLabel
source: User
ar: مستخدم

# loginInactiveSuccess
source: Your account has been reactivated successfully.
ar: تمت إعادة تفعيل حسابك بنجاح.

# productBadgeOnSale
source: On sale
ar: تخفيض

# productStatusDraft
source: Draft
ar: مسودة

# productStatusActive
source: Active
ar: نشط

# productStatusArchived
source: Archived
ar: مؤرشف

# errorNetworkNoInternet
source: No internet or server unreachable.
ar: لا يوجد إنترنت أو الخادم غير متاح.

# errorNetworkServerDown
source: The server is not responding. Please try again later.
ar: الخادم لا يستجيب. حاول لاحقًا.

# errorServerUnexpected
source: Unexpected server error. Please try again.
ar: خطأ غير متوقع في الخادم. حاول مرة أخرى.

# errorUnexpected
source: Unexpected error. Please try again.
ar: حدث خطأ غير متوقع. حاول مرة أخرى.

# errorAuthUnauthorized
source: Your session has expired. Please log in again.
ar: انتهت جلستك. يرجى تسجيل الدخول مجددًا.

# errorAuthForbidden
source: You don't have permission to perform this action.
ar: ليس لديك صلاحية لتنفيذ هذا الإجراء.

# logoutLabel
source: Logout
ar: تسجيل الخروج

# adminDashboardQuickActions
source: Quick actions
ar: إجراءات سريعة

# adminOverviewAnalytics
source: Overview & analytics
ar: نظرة عامة وإحصاءات

# adminProjectsOwners
source: Projects & owners
ar: المشاريع والمالكون

# adminUsersManagers
source: Users & managers
ar: المستخدمون والمدراء

# adminSettings
source: Settings
ar: الإعدادات

# adminSignedInAs
source: Signed in as {role}
ar: مسجل الدخول كـ {role}

# adminProductCreateTitle
source: Create product
ar: إنشاء منتج

# adminProductEditTitle
source: Edit product
ar: تعديل المنتج

# adminProductNameLabel
source: Name
ar: الاسم

# adminProductNameHint
source: Ex: MacBook Pro
ar: مثال: MacBook Pro

# adminProductNameRequired
source: Name is required
ar: الاسم مطلوب

# adminProductDescriptionLabel
source: Description
ar: الوصف

# adminProductDescriptionHint
source: Short description...
ar: وصف قصير...

# adminProductCategoryLabel
source: Category
ar: الفئة

# adminProductItemTypeLabel
source: Item type
ar: نوع العنصر

# adminProductPriceLabel
source: Price
ar: السعر

# adminProductPriceRequired
source: Price is required
ar: السعر مطلوب

# adminProductPriceInvalid
source: Price must be greater than 0
ar: يجب أن يكون السعر أكبر من 0

# adminProductStockLabel
source: Stock
ar: المخزون

# adminStockHint
source: Ex: 50
ar: مثال: 50

# adminProductImageLabel
source: Image
ar: الصورة

# adminProductPickImage
source: Pick image
ar: اختيار صورة

# adminRemove
source: Remove
ar: إزالة

# adminProductSkuHint
source: Ex: SKU-123
ar: مثال: SKU-123

# adminProductTypeLabel
source: Product type
ar: نوع المنتج

# adminProductTypeSimple
source: Simple
ar: بسيط

# adminProductTypeVariable
source: Variable
ar: متغير

# adminProductTypeGrouped
source: Grouped
ar: مجمع

# adminProductTypeExternal
source: External
ar: خارجي

# adminProductVirtualLabel
source: Virtual product
ar: منتج افتراضي

# adminProductDownloadableLabel
source: Downloadable
ar: قابل للتحميل

# adminProductDownloadUrlLabel
source: Download URL
ar: رابط التحميل

# adminProductExternalUrlLabel
source: External URL
ar: رابط خارجي

# adminProductButtonTextLabel
source: Button text
ar: نص الزر

# adminProductButtonTextHint
source: Buy now
ar: اشترِ الآن

# adminProductSaleSectionTitle
source: Sale
ar: تخفيض

# adminProductSalePriceLabel
source: Sale price
ar: سعر التخفيض

# adminProductSaleStartLabel
source: Sale start date
ar: تاريخ بداية التخفيض

# adminProductSaleEndLabel
source: Sale end date
ar: تاريخ نهاية التخفيض

# adminProductAttributesTitle
source: Attributes
ar: السمات

# adminProductAttributeCodeLabel
source: Attribute code
ar: كود السمة

# adminProductAttributeValueLabel
source: Value
ar: القيمة

# adminProductAddAttribute
source: Add attribute
ar: إضافة سمة

# adminProductNoAttributesHint
source: No attributes added yet.
ar: لا توجد سمات مضافة بعد.

# adminProductSaveButton
source: Save product
ar: حفظ المنتج

# adminNoCategories
source: No categories found
ar: لا توجد فئات

# adminCreateCategory
source: Create category
ar: إنشاء فئة

# adminNoItemTypes
source: No item types found
ar: لا توجد أنواع عناصر

# adminCreateItemType
source: Create item type
ar: إنشاء نوع عنصر

# adminTaxesTitle
source: Taxes
ar: الضرائب

# adminTaxRulesTitle
source: Tax Rules
ar: قواعد الضرائب

# adminTaxAddRule
source: Add tax rule
ar: إضافة قاعدة ضريبية

# adminTaxNoRules
source: No tax rules found.
ar: لا توجد قواعد ضريبية.

# adminTaxCreateRuleTitle
source: Create Tax Rule
ar: إنشاء قاعدة ضريبية

# adminTaxEditRuleTitle
source: Edit Tax Rule
ar: تعديل قاعدة ضريبية

# adminTaxRuleNameLabel
source: Rule name
ar: اسم القاعدة

# adminTaxRuleNameHint
source: Ex: Standard VAT 11%
ar: مثال: ضريبة القيمة المضافة 11%

# adminTaxRuleNameRequired
source: Tax rule name is required
ar: اسم القاعدة مطلوب

# adminTaxRuleRateLabel
source: Rate (%)
ar: النسبة (%)

# adminTaxRuleRateRequired
source: Rate is required
ar: النسبة مطلوبة

# adminTaxRuleRateInvalid
source: Rate must be a valid number > 0
ar: يجب أن تكون النسبة رقمًا صحيحًا > 0

# adminTaxAppliesToShippingLabel
source: Applies to shipping
ar: تُطبق على الشحن

# adminTaxEnabledLabel
source: Enabled
ar: مفعّل

# adminTaxCountryIdLabel
source: Country ID (optional)
ar: معرّف الدولة (اختياري)

# adminTaxRegionIdLabel
source: Region ID (optional)
ar: معرّف المنطقة (اختياري)

# adminTaxRateShort
source: Rate
ar: النسبة

# adminTaxAppliesToShippingShort
source: Shipping tax
ar: ضريبة الشحن

# adminTaxEnabledShort
source: Enabled
ar: مفعّل

# adminCancel
source: Cancel
ar: إلغاء

# adminCreate
source: Create
ar: إنشاء

# adminUpdate
source: Update
ar: تحديث

# adminEdit
source: Edit
ar: تعديل

# adminDelete
source: Delete
ar: حذف

source: Yes
ar: نعم

source: No
ar: لا

# adminSessionExpired
source: Your session has expired. Please log in again.
ar: انتهت جلستك. يرجى تسجيل الدخول مجددًا.

# adminTaxCountryLabel
source: Country
ar: الدولة

# adminTaxCountryHint
source: Select country
ar: اختر الدولة

# adminTaxRegionLabel
source: Region
ar: المنطقة

# adminTaxSelectCountryFirst
source: Select country first
ar: اختر الدولة أولًا

# adminTaxRegionHint
source: Select region
ar: اختر المنطقة

# adminTaxRulesTitleShort
source: Tax Rules
ar: قواعد الضرائب

# adminTaxRulesSubtitle
source: Manage tax rules for your products.
ar: إدارة قواعد الضرائب لمنتجاتك.

# taxPreviewLoading
source: Calculating tax preview...
ar: جارٍ حساب معاينة الضريبة...

# taxPreviewTitle
source: Tax Preview
ar: معاينة الضريبة

# itemsTaxLabel
source: Items Tax
ar: ضريبة المنتجات

# shippingTaxLabel
source: Shipping Tax
ar: ضريبة الشحن

# totalTaxLabel
source: Total Tax
ar: إجمالي الضريبة

# taxClassNone
source: No Tax
ar: بدون ضريبة

# taxClassStandard
source: Standard Rate
ar: نسبة قياسية

# taxClassReduced
source: Reduced Rate
ar: نسبة مخفضة

# taxClassZero
source: Zero Rate
ar: نسبة صفر

# taxClassLabel
source: Tax Class
ar: فئة الضريبة

# taxClassHint
source: Select tax class
ar: اختر فئة الضريبة

# adminTaxCountryRequired
source: Country is required
ar: الدولة مطلوبة

# adminTaxRegionRequired
source: Region is required
ar: المنطقة مطلوبة

# adminTaxRulePresetLabel
source: Rule Preset
ar: إعداد مسبق

# adminTaxRulePresetHint
source: Select a preset to auto-fill fields
ar: اختر إعدادًا مسبقًا لملء الحقول تلقائيًا

# adminCustom
source: Custom
ar: مخصص

# adminTaxAutoNameLabel
source: Auto-generate name
ar: إنشاء اسم تلقائيًا

# adminShippingTitle
source: Shipping Methods
ar: طرق الشحن

# adminShippingAdd
source: Add method
ar: إضافة طريقة

# adminShippingNoMethods
source: No shipping methods yet
ar: لا توجد طرق شحن بعد

# adminShippingCreateTitle
source: Create shipping method
ar: إنشاء طريقة شحن

# adminShippingEditTitle
source: Edit shipping method
ar: تعديل طريقة شحن

# adminShippingNameLabel
source: Name
ar: الاسم

# adminShippingNameRequired
source: Name is required
ar: الاسم مطلوب

# adminShippingDescLabel
source: Description
ar: الوصف

# adminShippingTypeLabel
source: Method type
ar: نوع الطريقة

# adminShippingTypeHint
source: Select type
ar: اختر النوع

# adminShippingFlatRateLabel
source: Flat rate
ar: سعر ثابت

# adminShippingPerKgLabel
source: Price per kg
ar: السعر لكل كغ

# adminShippingThresholdLabel
source: Free shipping threshold
ar: حد الشحن المجاني

# adminShippingCountryLabel
source: Country
ar: الدولة

# adminShippingCountryHint
source: Select country
ar: اختر الدولة

# adminShippingCountryRequired
source: Country is required
ar: الدولة مطلوبة

# adminShippingRegionLabel
source: Region
ar: المنطقة

# adminShippingRegionHint
source: Select region (optional)
ar: اختر المنطقة (اختياري)

# adminShippingSelectCountryFirst
source: Select country first
ar: اختر الدولة أولًا

# adminShippingEnabledLabel
source: Enabled
ar: مفعّل

# adminShippingEnabledShort
source: Enabled
ar: مفعّل

# adminShippingTypeShort
source: Type
ar: النوع

# shippingTypeFlatRate
source: Flat rate
ar: سعر ثابت

# shippingTypeFree
source: Free
ar: مجاني

# shippingTypeWeightBased
source: Weight based
ar: حسب الوزن

# shippingTypePriceBased
source: Price based
ar: حسب السعر

# shippingTypePricePerKg
source: Price per kg
ar: السعر لكل كغ

# shippingTypeLocalPickup
source: Local pickup
ar: استلام محلي

# shippingTypeFreeOverThreshold
source: Free over threshold
ar: مجاني فوق الحد

# adminConfirmDelete
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟

# adminShippingCreateButton
source: Create method
ar: إنشاء الطريقة

# adminDeleted
source: Deleted
ar: تم حذف العنصر بنجاح

# refreshLabel
source: Refresh
ar: تحديث

# adminEnabledOnly
source: Enabled only
ar: المفعّلة فقط

# adminShowAll
source: Show all
ar: عرض الكل

# adminDisabled
source: Disabled only
ar: المعطّلة فقط

# adminActive
source: Active only
ar: النشطة فقط

# adminCreated
source: Created
ar: تم الإنشاء بنجاح

# adminUpdated
source: Updated
ar: تم التحديث بنجاح

# cart_title
source: Shopping Cart
ar: سلة التسوق

# cart_empty_message
source: Your cart is empty. Start adding items!
ar: سلتك فارغة. ابدأ بإضافة المنتجات!

# cart_total_label
source: Total:
ar: الإجمالي:

# cart_checkout_button
source: Proceed to Checkout
ar: متابعة للدفع

# cart_item_added
source: Item added to cart
ar: تمت إضافة المنتج إلى السلة

# cart_item_removed
source: Item removed from cart
ar: تمت إزالة المنتج من السلة

# cart_clear_confirmation
source: Are you sure you want to clear the cart?
ar: هل أنت متأكد أنك تريد تفريغ السلة؟

# cart_item_quantity_label
source: Quantity:
ar: الكمية:

source: Cart item updated
ar: تم تحديث عنصر السلة

# cart_checkout
source: Checkout
ar: الدفع

# cart_clear
source: Clear Cart
ar: تفريغ السلة

# cart_empty_cta
source: Browse Products
ar: تصفح المنتجات

# cart_cleared
source: Cart has been cleared
ar: تم تفريغ السلة

# cart_add_button
source: Add to Cart
ar: أضف إلى السلة

# home_book_now_button
source: Book Now
ar: احجز الآن

# home_view_details_button
source: View Details
ar: عرض التفاصيل

# cart_login_required_title
source: Login Required
ar: تسجيل الدخول مطلوب

# cart_login_required_message
source: Please log in to proceed to checkout.
ar: يرجى تسجيل الدخول لإكمال الدفع.

# cancel_button
source: Cancel
ar: إلغاء

# login_button
source: Log In
ar: تسجيل الدخول

# cart_item_added_snackbar
source: Item added to cart
ar: تمت إضافة المنتج إلى السلة

# coupons_title
source: Coupons
ar: القسائم

# coupons_saved
source: Coupon saved successfully
ar: تم حفظ القسيمة بنجاح

# coupons_deleted
source: Coupon deleted successfully
ar: تم حذف القسيمة بنجاح

# coupons_empty
source: No coupons yet. Create your first one!
ar: لا توجد قسائم بعد. أنشئ أول واحدة!

# coupons_type_percent
source: Percentage
ar: خصم بالنسبة المئوية

# coupons_type_fixed
source: Fixed amount
ar: خصم بمبلغ ثابت

# coupons_type_free_shipping
source: Free shipping
ar: شحن مجاني

# coupons_inactive_badge
source: Inactive
ar: غير نشطة

# coupons_delete_title
source: Delete coupon
ar: حذف القسيمة

# coupons_delete_confirm
source: Are you sure you want to delete coupon {code}?
ar: هل أنت متأكد أنك تريد حذف القسيمة {code}؟

source: Delete
ar: حذف

# coupons_add
source: Add coupon
ar: إضافة قسيمة

# coupons_edit
source: Edit coupon
ar: تعديل القسيمة

# coupons_code
source: Code
ar: الكود

# coupons_code_required
source: Coupon code is required
ar: كود القسيمة مطلوب

# coupons_description
source: Description
ar: الوصف

# coupons_type
source: Discount type
ar: نوع الخصم

# coupons_value_percent
source: Discount (%)
ar: الخصم (%)

# coupons_value_amount
source: Discount amount
ar: قيمة الخصم

# coupons_value_required
source: Discount value is required
ar: قيمة الخصم مطلوبة

# coupons_value_invalid
source: Enter a valid discount value
ar: أدخل قيمة خصم صحيحة

# coupons_max_uses
source: Max uses
ar: الحد الأقصى للاستخدام

# coupons_min_order_amount
source: Min order amount
ar: أقل مبلغ للطلب

# coupons_max_discount_amount
source: Max discount amount
ar: أقصى خصم

# coupons_active
source: Active
ar: نشطة

# common_save
source: Save
ar: حفظ

# adminCouponsTitle
source: Coupons
ar: القسائم

# checkoutTitle
source: Checkout
ar: الدفع

# checkoutLoading
source: Loading checkout…
ar: جارٍ تحميل الدفع…

# checkoutEmptyCart
source: Your cart is empty.
ar: سلتك فارغة.

# checkoutGoBack
source: Go back
ar: رجوع

# checkoutItemsTitle
source: Items
ar: المنتجات

# checkoutAddressTitle
source: Shipping Address
ar: عنوان الشحن
