Repository: fatimahh0/build4allFront
Catalog: lib/l10n/app_*.arb
Languages: ar

# checkoutCountryIdLabel
source: Country ID
ar: معرّف الدولة

# checkoutCountryIdHint
source: Optional
ar: اختياري

# checkoutRegionIdLabel
source: Region ID
ar: معرّف المنطقة

# checkoutRegionIdHint
source: Optional
ar: اختياري

# checkoutCityLabel
source: City
ar: المدينة

# checkoutCityHint
source: Enter city
ar: أدخل المدينة

# checkoutPostalCodeLabel
source: Postal Code
ar: الرمز البريدي

# checkoutPostalCodeHint
source: Optional
ar: اختياري

# checkoutApplyAddress
source: Update shipping
ar: تحديث الشحن

# checkoutCouponTitle
source: Coupon
ar: قسيمة

# checkoutCouponLabel
source: Coupon Code
ar: كود القسيمة

# checkoutCouponHint
source: Enter coupon (optional)
ar: أدخل القسيمة (اختياري)

# checkoutShippingTitle
source: Shipping
ar: الشحن

# checkoutNoShippingMethods
source: No shipping methods found. Update address then refresh.
ar: لم يتم العثور على طرق شحن. حدّث العنوان ثم قم بالتحديث.

# checkoutRefreshShipping
source: Refresh shipping
ar: تحديث الشحن

# checkoutSelectShipping
source: Please select a shipping method
ar: يرجى اختيار طريقة الشحن

# checkoutPaymentTitle
source: Payment
ar: الدفع

# checkoutPaymentCash
source: Cash on delivery
ar: الدفع عند الاستلام

# checkoutStripeNote
source: Stripe requires payment confirmation (coming next).
ar: Stripe يتطلب تأكيد الدفع (قريبًا).

# checkoutSelectPayment
source: Please select a payment method
ar: يرجى اختيار طريقة الدفع

# checkoutSummaryTitle
source: Order Summary
ar: ملخص الطلب

# checkoutSubtotal
source: Subtotal
ar: المجموع الفرعي

# checkoutShipping
source: Shipping
ar: الشحن

# checkoutTax
source: Tax
ar: الضريبة

# checkoutTotal
source: Total
ar: الإجمالي

# checkoutPlaceOrder
source: Place Order
ar: إتمام الطلب

# orderSummaryTitle
source: Order summary
ar: ملخص الطلب

source: Secure checkout
ar: دفع آمن

# itemsSubtotalLabel
source: Items subtotal
ar: المجموع الفرعي للمنتجات

# shippingLabel
source: Shipping
ar: الشحن

# taxLabel
source: Tax
ar: الضريبة

# discountLabel
source: Discount
ar: الخصم

# totalLabel
source: Total
ar: الإجمالي

# taxesShippingNote
source: Taxes and shipping are calculated based on your address.
ar: يتم احتساب الضرائب والشحن حسب العنوان.

# searchHint
source: Search...
ar: بحث...

source: No options
ar: لا توجد خيارات

source: No results
ar: لا توجد نتائج

source: Missing user token
ar: رمز المستخدم مفقود

# itemNumber
source: Item #{id}
ar: العنصر رقم {id}

# checkoutOrderPlacedToast
source: Order placed ✅ (# {orderId})
ar: تم إنشاء الطلب ✅ (#{orderId})

# orderTitle
source: Order #{orderId}
ar: طلب رقم {orderId}

# orderDateLabel
source: Date: {date}
ar: التاريخ: {date}

# orderItemsTitle
source: Items
ar: المنتجات

# orderQtyUnitLine
source: Qty: {qty} • Unit: {unit}
ar: الكمية: {qty} • سعر الوحدة: {unit}

# grandTotalLabel
source: Grand Total
ar: الإجمالي النهائي

source: Download Invoice PDF
ar: تحميل فاتورة PDF

# checkoutErrorCartEmpty
source: Cart is empty
ar: السلة فارغة

# checkoutErrorSelectPayment
source: Select a payment method
ar: اختر طريقة الدفع

# checkoutErrorSelectCountry
source: Select a country
ar: اختر الدولة

# checkoutErrorSelectRegion
source: Select a region
ar: اختر المنطقة

# checkoutErrorEnterCity
source: Enter city
ar: أدخل المدينة

# checkoutErrorEnterPostalCode
source: Enter postal code
ar: أدخل الرمز البريدي

# checkoutErrorSelectShipping
source: Select a shipping method
ar: اختر طريقة الشحن

# checkoutErrorShippingMissing
source: Shipping method is missing
ar: طريقة الشحن مفقودة

# checkoutErrorStripeNotReady
source: Stripe not wired yet
ar: Stripe غير جاهز بعد

# orderDetailsTitle
source: Order #{orderId}
ar: تفاصيل الطلب رقم {orderId}

# orderDetailsDateLine
source: Date: {date}
ar: التاريخ: {date}

# orderDetailsItemsTitle
source: Items
ar: المنتجات

# orderDetailsItemFallback
source: Item #{itemId}
ar: عنصر #{itemId}

# orderDetailsQtyUnitLine
source: Qty: {qty} • Unit: {unitPrice}
ar: الكمية: {qty} • سعر الوحدة: {unitPrice}

# orderDetailsSubtotal
source: Subtotal
ar: المجموع الفرعي

# orderDetailsShipping
source: Shipping
ar: الشحن

# orderDetailsTax
source: Tax
ar: الضريبة

# orderDetailsCouponLine
source: Coupon ({code})
ar: قسيمة ({code})

# orderDetailsGrandTotal
source: Grand Total
ar: الإجمالي النهائي

# orderDetailsDownloadInvoice
source: Download Invoice PDF
ar: تحميل فاتورة PDF

# common_stock_label
source: Stock: {stock}
ar: المخزون: {stock}

# ordersTitle
source: My Orders
ar: طلباتي

# ordersLoading
source: Loading orders…
ar: جارٍ تحميل الطلبات…

# ordersEmptyTitle
source: No orders yet
ar: لا توجد طلبات بعد

# ordersEmptyBody
source: When you place an order, it will show up here.
ar: عندما تقوم بإنشاء طلب، سيظهر هنا.

# ordersReload
source: Reload
ar: إعادة التحميل

# ordersFilterAll
source: All
ar: الكل

# ordersFilterPending
source: Pending
ar: قيد الانتظار

# ordersFilterCompleted
source: Completed
ar: مكتمل

# ordersFilterCanceled
source: Canceled
ar: ملغي

# ordersNoResultsForFilter
source: No orders match this filter.
ar: لا توجد طلبات مطابقة لهذا الفلتر.

# ordersQtyLabel
source: Qty
ar: الكمية

# ordersPaid
source: Paid
ar: مدفوع

# ordersUnpaid
source: Unpaid
ar: غير مدفوع

# ordersStatusPending
source: Pending
ar: قيد الانتظار

# ordersStatusCompleted
source: Completed
ar: مكتمل

# ordersStatusCanceled
source: Canceled
ar: ملغي

# ordersStatusUnknown
source: Unknown
ar: غير معروف

# ordersUnknownItem
source: Item
ar: عنصر

# ordersQty
source: Qty
ar: الكمية

# profileLoginRequired
source: Please log in to view your profile.
ar: يرجى تسجيل الدخول لعرض ملفك الشخصي.

# sessionExpired
source: Session expired. Please log in again.
ar: انتهت الجلسة. يرجى تسجيل الدخول مجددًا.

source: Login
ar: تسجيل الدخول

# editProfileTitle
source: Edit Profile
ar: تعديل الملف الشخصي

# profileLoadFailed
source: Failed to load profile.
ar: فشل تحميل الملف الشخصي.

source: Username
ar: اسم المستخدم

source: First name
ar: الاسم الأول

source: Last name
ar: اسم العائلة

source: Public profile
ar: ملف شخصي عام

source: Save
ar: حفظ

source: Danger zone
ar: منطقة الخطر

source: Password
ar: كلمة المرور

source: Delete account
ar: حذف الحساب

# notifications_title
source: Notifications
ar: الإشعارات

# notifications_empty_title
source: No notifications yet
ar: لا توجد إشعارات بعد

# notifications_empty_subtitle
source: When something happens, it’ll show up here. For now… peace and quiet 😌
ar: عندما يحدث شيء، سيظهر هنا. حاليًا… هدوء تام 😌

# notifications_retry
source: Retry
ar: إعادة المحاولة

# privacy_policy_title
source: Privacy Policy
ar: سياسة الخصوصية

# privacy_policy_intro_title
source: Your privacy matters
ar: خصوصيتك تهمّنا

# privacy_policy_intro_body
source: This policy explains what we collect, why we collect it, and how you control your data.
ar: تشرح هذه السياسة ما نجمعه ولماذا وكيف يمكنك التحكم ببياناتك.

# privacy_policy_collect_title
source: What we collect
ar: ما الذي نجمعه

# privacy_policy_collect_body
source: Basic profile info (name, email/phone), account settings, and app usage needed to provide the service.
ar: معلومات أساسية (الاسم، البريد/الهاتف)، إعدادات الحساب، واستخدام التطبيق الضروري لتقديم الخدمة.

# privacy_policy_use_title
source: How we use your data
ar: كيف نستخدم بياناتك

# privacy_policy_use_body
source: To run the app, personalize your experience, improve features, and keep the platform secure.
ar: لتشغيل التطبيق، تخصيص تجربتك، تحسين الميزات، وحماية المنصة.

# privacy_policy_share_title
source: Sharing
ar: المشاركة

# privacy_policy_share_body
source: We don’t sell your data. We only share what’s needed with trusted services (like hosting) to operate the app.
ar: لا نبيع بياناتك. نشارك فقط ما يلزم مع خدمات موثوقة (مثل الاستضافة) لتشغيل التطبيق.

# privacy_policy_security_title
source: Security
ar: الأمان

# privacy_policy_security_body
source: We use standard security practices, but no system is 100% perfect. Keep your password private.
ar: نستخدم ممارسات أمان قياسية، لكن لا يوجد نظام مثالي 100%. حافظ على كلمة المرور.

# privacy_policy_choices_title
source: Your choices
ar: خياراتك

# privacy_policy_choices_body
source: You can change visibility (public/private), update profile info, or request account actions based on the app features.
ar: يمكنك تغيير الخصوصية (عام/خاص)، تحديث الملف الشخصي، أو طلب إجراءات على الحساب حسب ميزات التطبيق.

# privacy_policy_contact_title
source: Contact
ar: التواصل

# privacy_policy_contact_body
source: If you have questions about privacy, contact the app support team.
ar: إذا كان لديك أسئلة حول الخصوصية، تواصل مع فريق الدعم.

# privacy_policy_last_updated
source: Last updated: Dec 19, 2025
ar: آخر تحديث: 19 ديسمبر 2025

# home_bottom_slide_thankyou_title
source: THANK YOU
ar: شكرًا لك

# home_bottom_slide_thankyou_message
source: We appreciate your trust. Our team works daily to keep quality high and service fast.
ar: نقدّر ثقتك. فريقنا يعمل يوميًا للحفاظ على الجودة وسرعة الخدمة.

# home_bottom_slide_secure_title
source: SECURE & SAFE
ar: آمن ومحمي

# home_bottom_slide_secure_message
source: Secure payments, controlled products, and clean packaging — the basics done right.
ar: مدفوعات آمنة، منتجات مضبوطة، وتغليف نظيف — الأساسيات بشكل صحيح.

# home_bottom_slide_support_title
source: REAL SUPPORT
ar: دعم حقيقي

# home_bottom_slide_support_message
source: Need help? We reply. No “seen” and disappear vibes 😅
ar: تحتاج مساعدة؟ نحن نرد. مش جو “Seen” وبس 😅

# home_bottom_benefit_contact
source: CONTACT AN ACCREDITED EXPERT
ar: تواصل مع خبير معتمد

# home_bottom_benefit_secure_payments
source: SECURED PAYMENTS
ar: مدفوعات آمنة

# home_bottom_benefit_authentic_products
source: AUTHENTIC & CONTROLLED PRODUCTS
ar: منتجات أصلية ومراقبة

# home_bottom_benefit_free_delivery_above
source: FREE DELIVERY ABOVE {amount}
ar: توصيل مجاني فوق {amount}

# home_trailing_limited_time
source: Limited time
ar: لفترة محدودة

# home_trailing_see_all
source: See all
ar: عرض الكل

# home_sale_tag
source: SALE
ar: تخفيض

# home_stock_label
source: Stock: {count}
ar: المخزون: {count}

# home_bookings_placeholder
source: Bookings feed not wired yet.
ar: قسم الحجوزات غير جاهز بعد.

# home_footer_contact_title
source: Contact us
ar: تواصل معنا

# home_footer_contact_desc
source: Need help? We’re one message away.
ar: تحتاج مساعدة؟ نحن على بعد رسالة.

# home_footer_free_delivery_title
source: Free delivery
ar: توصيل مجاني

# home_footer_free_delivery_desc
source: Available on selected orders and areas.
ar: متاح على طلبات ومناطق محددة.

# home_footer_returns_title
source: Easy returns
ar: إرجاع سهل

# home_footer_returns_desc
source: Simple return policy on eligible items.
ar: سياسة إرجاع بسيطة للعناصر المؤهلة.

# ownerPaymentSettingsTitle
source: Payment Methods
ar: طرق الدفع

# ownerPaymentSettingsDesc
source: Enable and configure gateways for this project
ar: فعّل وادخل إعدادات بوابات الدفع لهذا المشروع

# ownerPaymentConfigure
source: Configure
ar: إعداد

# ownerPaymentIncomplete
source: Incomplete
ar: غير مكتمل

# ownerPaymentConfigHint
source: Configure fields below. Required fields must be filled.
ar: قم بإعداد الحقول أدناه. الحقول المطلوبة يجب تعبئتها.

# paymentMethodsTitle
source: Payment Methods
ar: طرق الدفع

# paymentSearchHint
source: Search…
ar: بحث…

# paymentNoResults
source: No results
ar: لا توجد نتائج

# paymentConfigure
source: Configure
ar: إعداد

# paymentCancel
source: Cancel
ar: إلغاء

# paymentSave
source: Save
ar: حفظ

# paymentFillFields
source: Fill the fields below, then Save.
ar: املأ الحقول أدناه ثم اضغط حفظ.

# paymentSavedKeepHint
source: Saved (leave empty to keep)
ar: محفوظ (اتركه فارغًا للاحتفاظ)

# paymentRequiredLabel
source: • required
ar: • مطلوب

# paymentIncomplete
source: Incomplete
ar: غير مكتمل

# adminPaymentConfigTitle
source: Payment Methods
ar: طرق الدفع

# checkoutConfirmDialogTitle
source: Confirm checkout
ar: تأكيد الدفع

# checkoutConfirmCartCleared
source: {itemCount, plural, =0{After checkout, your cart will become empty.} =1{After checkout, your cart will become empty (1 item).} other{After checkout, your cart will become empty ({itemCount} items).}} Do you want to continue?
ar: {itemCount, plural, =0{بعد الدفع ستصبح سلتك فارغة.} =1{بعد الدفع ستصبح سلتك فارغة (عنصر واحد).} other{بعد الدفع ستصبح سلتك فارغة ({itemCount} عناصر).}} هل تريد المتابعة؟

# commonYes
source: Yes
ar: نعم

# commonNo
source: No
ar: لا

# adminOrdersTitle
source: Orders
ar: الطلبات

# adminDashboard
source: Dashboard
ar: لوحة التحكم

# adminAllTime
source: All time
ar: كل الوقت

# adminLast7Days
source: Last 7 days
ar: آخر 7 أيام

# adminLast30Days
source: Last 30 days
ar: آخر 30 يومًا

# adminClear
source: Clear
ar: مسح

# adminKpiOrders
source: Orders
ar: الطلبات

# adminKpiGrossSales
source: Gross Sales
ar: إجمالي المبيعات

# adminKpiPaid
source: Paid
ar: مدفوع

# adminKpiOutstanding
source: Outstanding
ar: متبقي

# adminKpiAvgOrder
source: Avg Order
ar: متوسط الطلب

# adminFullyPaidPercent
source: Fully paid: {percent}%
ar: مدفوع بالكامل: {percent}%

# adminPaidRevenueLast7Days
source: Paid revenue (last 7 days)
ar: الإيراد المدفوع (آخر 7 أيام)

# adminNoOrders
source: No orders
ar: لا توجد طلبات

# adminNoOrdersHint
source: Try changing the status filter, date range, or pull to refresh.
ar: جرّب تغيير الحالة أو الفترة أو اسحب للتحديث.

# adminFilterAll
source: All
ar: الكل

# adminOrderDetailsTitle
source: Order #{id}
ar: طلب رقم {id}

# adminOrderFailedToLoad
source: Failed to load order.
ar: فشل تحميل الطلب.

# adminPaymentSummary
source: Payment Summary
ar: ملخص الدفع

# adminOrderInfo
source: Order Info
ar: معلومات الطلب

# adminStatus
source: Status
ar: الحالة

# adminOrderTotal
source: Order Total
ar: إجمالي الطلب

# adminPaid
source: Paid
ar: مدفوع

# adminRemaining
source: Remaining
ar: متبقي

# adminPaymentMethod
source: Payment Method
ar: طريقة الدفع

# adminCurrency
source: Currency
ar: العملة

# adminShippingCity
source: Shipping City
ar: مدينة الشحن

# adminShippingMethod
source: Shipping Method
ar: طريقة الشحن

# adminCoupon
source: Coupon
ar: قسيمة

# adminItemsCount
source: Items ({count})
ar: العناصر ({count})

# adminCustomer
source: Customer
ar: العميل

# adminQtyPriceLine
source: Qty: {qty} • Price: {price}
ar: الكمية: {qty} • السعر: {price}

# adminOrderCardTitle
source: Order #{id}
ar: طلب رقم {id}

# adminItemsShort
source: {count} items
ar: {count} عناصر

# adminPaidShort
source: Paid: {amount}
ar: مدفوع: {amount}

# adminRemainingShort
source: Remaining: {amount}
ar: متبقي: {amount}

# adminFullyPaid
source: Fully paid
ar: مدفوع بالكامل

# adminOrderStatusPending
source: Pending
ar: قيد الانتظار

# adminOrderStatusCancelRequested
source: Cancel requested
ar: طلب إلغاء

# adminOrderStatusCanceled
source: Canceled
ar: ملغي

# adminOrderStatusRejected
source: Rejected
ar: مرفوض

# adminOrderStatusRefunded
source: Refunded
ar: مسترجع

# adminOrderStatusCompleted
source: Completed
ar: مكتمل

# adminMarkCashPaidBody
source: Are you sure you want to mark this order as paid in cash?
ar: هل أنت متأكد أنك تريد وضع الطلب كمدفوع نقدًا؟

# adminMarkCashPaid
source: Mark as paid in cash
ar: اعتباره مدفوع نقدًا

# adminMarkCashPaidTitle
source: Mark order as paid
ar: وضع الطلب كمدفوع

# adminMarkCashPaidButton
source: Mark as paid
ar: وضع كمدفوع

# forgotPasswordLink
source: Forgot password?
ar: هل نسيت كلمة المرور؟

# forgotTitle
source: Reset your password
ar: إعادة تعيين كلمة المرور

# forgotSubtitle
source: Enter your email and we’ll send you a code.
ar: أدخل بريدك الإلكتروني وسنرسل لك رمزًا.

# forgotSendCode
source: Send code
ar: إرسال الرمز

# forgotTip
source: Tip: check spam/junk folder too 👀
ar: ملاحظة: تحقق من الرسائل غير المرغوب فيها أيضًا 👀

# forgotVerifyTitle
source: Enter verification code
ar: إدخال رمز التحقق

# forgotVerifySubtitle
source: We sent a code to {email}
ar: أرسلنا رمزًا إلى {email}

# forgotNewPassTitle
source: Set a new password
ar: تعيين كلمة مرور جديدة

# forgotNewPassSubtitle
source: Make it strong — future you will thank you.
ar: اجعلها قوية — نفسك المستقبلية ستشكرك.

# newPasswordLabel
source: New password
ar: كلمة المرور الجديدة

# savePasswordButton
source: Save password
ar: حفظ كلمة المرور

# codeLabel
source: Code
ar: الرمز

# codeTooShort
source: Code is too short
ar: الرمز قصير جدًا

# verifyButton
source: Verify
ar: تحقق

source: Resend code
ar: إعادة إرسال الرمز

# passwordsDontMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# checkoutFullNameLabel
source: Full name
ar: الاسم الكامل

# checkoutFullNameHint
source: your Name
ar: اسمك

# checkoutAddressLineLabel
source: Street address
ar: العنوان

# checkoutAddressLineHint
source: e.g. Building, floor, street name
ar: مثال: المبنى، الطابق، اسم الشارع

# checkoutPhoneLabel
source: Phone number
ar: رقم الهاتف

# checkoutPhoneHint
source: e.g. +961 70 123 456
ar: مثال: +961 70 123 456

# checkoutNotesLabel
source: Delivery notes (optional)
ar: ملاحظات التوصيل (اختياري)

# checkoutNotesHint
source: e.g. Call me when you arrive
ar: مثال: اتصل بي عند الوصول
